zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE1_Bits.L3L4FNUM */
#define IFX_GETH_MAC_HW_FEATURE1_L3L4FNUM_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE1_Bits.L3L4FNUM */
#define IFX_GETH_MAC_HW_FEATURE1_L3L4FNUM_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXQCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXQCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXQCNT_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.RXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_RXCHCNT_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.TXCHCNT */
#define IFX_GETH_MAC_HW_FEATURE2_TXCHCNT_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.PPSOUTNUM */
#define IFX_GETH_MAC_HW_FEATURE2_PPSOUTNUM_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE2_Bits.AUXSNAPNUM */
#define IFX_GETH_MAC_HW_FEATURE2_AUXSNAPNUM_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.NRVF */
#define IFX_GETH_MAC_HW_FEATURE3_NRVF_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.CBTISEL */
#define IFX_GETH_MAC_HW_FEATURE3_CBTISEL_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE3_Bits.DVLAN */
#define IFX_GETH_MAC_HW_FEATURE3_DVLAN_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GB */
#define IFX_GETH_MAC_MDIO_ADDRESS_GB_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.C45E */
#define IFX_GETH_MAC_MDIO_ADDRESS_C45E_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_0 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_0_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.GOC_1 */
#define IFX_GETH_MAC_MDIO_ADDRESS_GOC_1_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.SKAP */
#define IFX_GETH_MAC_MDIO_ADDRESS_SKAP_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_LEN (4u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.CR */
#define IFX_GETH_MAC_MDIO_ADDRESS_CR_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.NTC */
#define IFX_GETH_MAC_MDIO_ADDRESS_NTC_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.RDA */
#define IFX_GETH_MAC_MDIO_ADDRESS_RDA_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_LEN (5u)

