zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_RXUDP_ERROR_PACKETS_Bits.RXUDPERRPKT */
#define IFX_GETH_RXUDP_ERROR_PACKETS_RXUDPERRPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXTCP_GOOD_PACKETS_Bits.RXTCPGDPKT */
#define IFX_GETH_RXTCP_GOOD_PACKETS_RXTCPGDPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXTCP_GOOD_PACKETS_Bits.RXTCPGDPKT */
#define IFX_GETH_RXTCP_GOOD_PACKETS_RXTCPGDPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXTCP_GOOD_PACKETS_Bits.RXTCPGDPKT */
#define IFX_GETH_RXTCP_GOOD_PACKETS_RXTCPGDPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXTCP_ERROR_PACKETS_Bits.RXTCPERRPKT */
#define IFX_GETH_RXTCP_ERROR_PACKETS_RXTCPERRPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXTCP_ERROR_PACKETS_Bits.RXTCPERRPKT */
#define IFX_GETH_RXTCP_ERROR_PACKETS_RXTCPERRPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXTCP_ERROR_PACKETS_Bits.RXTCPERRPKT */
#define IFX_GETH_RXTCP_ERROR_PACKETS_RXTCPERRPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXICMP_GOOD_PACKETS_Bits.RXICMPGDPKT */
#define IFX_GETH_RXICMP_GOOD_PACKETS_RXICMPGDPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXICMP_GOOD_PACKETS_Bits.RXICMPGDPKT */
#define IFX_GETH_RXICMP_GOOD_PACKETS_RXICMPGDPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXICMP_GOOD_PACKETS_Bits.RXICMPGDPKT */
#define IFX_GETH_RXICMP_GOOD_PACKETS_RXICMPGDPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXICMP_ERROR_PACKETS_Bits.RXICMPERRPKT */
#define IFX_GETH_RXICMP_ERROR_PACKETS_RXICMPERRPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXICMP_ERROR_PACKETS_Bits.RXICMPERRPKT */
#define IFX_GETH_RXICMP_ERROR_PACKETS_RXICMPERRPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXICMP_ERROR_PACKETS_Bits.RXICMPERRPKT */
#define IFX_GETH_RXICMP_ERROR_PACKETS_RXICMPERRPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_GETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_GETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_GETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_GETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_GETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_GETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_GETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_GETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_GETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_GETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_GETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_GETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_GETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_GETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_GETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_GETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_LEN (32u)

