zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_GETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_GETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_GETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_GETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_GETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_GETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_GETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_GETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_OFF (0u)

/** \brief Length for Ifx_GETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_GETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_LEN (32u)

/** \brief Mask for Ifx_GETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_GETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RXICMP_ERROR_OCTETS_Bits.RXICMPERROCT */
#define IFX_GETH_RXICMP_ERROR_OCTETS_RXICMPERROCT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENA_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCFUPDT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCFUPDT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCFUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCFUPDT_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSINIT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSINIT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSINIT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSINIT_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSUPDT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSUPDT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSUPDT */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSUPDT_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSADDREG_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSADDREG_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSADDREG */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSADDREG_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENALL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENALL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSENALL */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSENALL_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSCTRLSSR */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSCTRLSSR_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSVER2ENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSVER2ENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSVER2ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSVER2ENA_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPENA_OFF (11u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV6ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV6ENA_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSIPV4ENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSIPV4ENA_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSEVNTENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSEVNTENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSEVNTENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSEVNTENA_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSMSTRENA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSMSTRENA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_TIMESTAMP_CONTROL_Bits.TSMSTRENA */
#define IFX_GETH_MAC_TIMESTAMP_CONTROL_TSMSTRENA_OFF (15u)

