zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.SLC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_SLC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.SLC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_SLC_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_TXQ_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ_ETS_STATUS_ABS_LEN (24u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ_ETS_STATUS_ABS_MSK (0xffffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_ETS_STATUS_Bits.ABS */
#define IFX_GETH_MTL_TXQ_ETS_STATUS_ABS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ_QUANTUM_WEIGHT_ISCQW_LEN (21u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ_QUANTUM_WEIGHT_ISCQW_MSK (0x1fffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_QUANTUM_WEIGHT_Bits.ISCQW */
#define IFX_GETH_MTL_TXQ_QUANTUM_WEIGHT_ISCQW_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_SENDSLOPECREDIT_Bits.SSC */
#define IFX_GETH_MTL_TXQ_SENDSLOPECREDIT_SSC_LEN (14u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_SENDSLOPECREDIT_Bits.SSC */
#define IFX_GETH_MTL_TXQ_SENDSLOPECREDIT_SSC_MSK (0x3fffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_SENDSLOPECREDIT_Bits.SSC */
#define IFX_GETH_MTL_TXQ_SENDSLOPECREDIT_SSC_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_HICREDIT_Bits.HC */
#define IFX_GETH_MTL_TXQ_HICREDIT_HC_LEN (29u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_HICREDIT_Bits.HC */
#define IFX_GETH_MTL_TXQ_HICREDIT_HC_MSK (0x1fffffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_HICREDIT_Bits.HC */
#define IFX_GETH_MTL_TXQ_HICREDIT_HC_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_LOCREDIT_Bits.LC */
#define IFX_GETH_MTL_TXQ_LOCREDIT_LC_LEN (29u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_LOCREDIT_Bits.LC */
#define IFX_GETH_MTL_TXQ_LOCREDIT_LC_MSK (0x1fffffffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_LOCREDIT_Bits.LC */
#define IFX_GETH_MTL_TXQ_LOCREDIT_LC_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUNFIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUNFIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUNFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUNFIS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.TXUIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_TXUIE_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.ABPSIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_ABPSIE_OFF (9u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOVFIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOVFIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOVFIS */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOVFIS_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOIE_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_Bits.RXOIE */
#define IFX_GETH_MTL_Q_INTERRUPT_CONTROL_STATUS_RXOIE_OFF (24u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RTC_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RTC_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RTC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RTC_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FUP_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FUP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FUP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FUP_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FEP_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FEP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.FEP */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_FEP_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RSF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RSF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RSF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RSF_OFF (5u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_DIS_TCP_EF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_DIS_TCP_EF_MSK (0x1u)

